/*****************************************************************
	
						单片机接受数据帧格式
	┌────────┬─────┬───────────────────┬────────────┬────────────┐
	│ index  │  0  │         1         │  ········	│     X		 │ 
	├────────┼─────┼───────────────────┼────────────┼────────────┤
	│数据    │0x7F │0（数据）/1（指令）│数据/指令	│    0x7F    │			    
	└────────┴─────┴───────────────────┴────────────┴────────────┘	
			  
******************************************************************/
#include <bluetooth.h>
#define MAXSIZE 17  //定义数据帧最大接受/发送长度
uchar BluRecData[MAXSIZE];
uchar RecIndex=0;
uchar flag=0;//是否有数据更新
uchar isRec=0;//是否接收数据标志 

/*******************************************************************************
* 函数名         : BluInit
* 函数功能		 : 初始化蓝牙模块 波特率9600
* 输入           : 无
* 输出         	 : 无
*******************************************************************************/
void BluInit(void)
{
    TMOD = 0x20;
    SCON = 0x50;
    TH1 = 0xFD;
    TL1 = TH1;
    PCON = 0x00;
    EA = 1;
    ES = 1;
    TR1 = 1;
}

/*******************************************************************************
* 函数名         : Delay1ms
* 函数功能		   : 延时函数
* 输入           : 延时时长，单位ms
* 输出         	 : 无
*******************************************************************************/

void Delay_1ms(uint c)
{
	uchar a,b;
	for (; c>0; c--)
	{
		 for (b=199;b>0;b--)
		 {
		  	for(a=1;a>0;a--);
		 }      
	}
}

/*******************************************************************************
* 函数名         : BluSendByte
* 函数功能		 : 蓝牙发送单个字节
* 输入           : 无
* 输出         	 : 无
*******************************************************************************/
void BluSendByte(uchar c)
{  
	ES=0;  						//关闭串口中断  
	TI=0;   					//清发送完毕中断请求标志位   
	SBUF=c; 				//发送  
	while(TI==0); 				//等待发送完毕   
	TI=0;   					//清发送完毕中断请求标志位   
	ES=1;  						//允许串口中断
	TH0=0;
	TL0=0;  
}

/*******************************************************************************
* 函数名         : BluSendStr
* 函数功能		 : 蓝牙发送字符串
* 输入           : 字符指针s
* 输出         	 : 无
*******************************************************************************/
void BluSendStr(uchar *s)
{	
	uchar i=0;
	uchar *str;
	str=s;
	while(str[i]!='\0')
	{
	 	BluSendByte(str[i]);
		Delay_1ms(5);
		i++;
	}
}

/*******************************************************************************
* 函数名         : BluReceive
* 函数功能		 : 串口中断函数	 负责接受蓝牙数据
* 输入           : 无
* 输出         	 : 无
*******************************************************************************/
void BluReceive(void) interrupt 4 
{
    if(RI)
    {
        RI = 0;
		if(SBUF==0x7F)
		{
			//RecIndex=0则是帧头，否则为帧尾
			if(RecIndex!=0)//接受完一组数据后刷新flag并设置为不接收数据模式（数据不存入BluRecData）
			{
				flag=1;
				isRec=0;
				BluRecData[RecIndex]='\0';	
			}
			else  
			{
				isRec=1;//设置为接收数据模式（数据存入BluRecData）
				flag=0;//
			}
			RecIndex=0;//接受完一组数据和刚开始接受数据都将RecIndex置0
		}
		else
		{	
			if(isRec)//若为数据接收模式则将数据存入BluRecData
			{
				BluRecData[RecIndex]=SBUF;
				RecIndex++;
			}
		}    
    }
    else
        TI = 0;
}						                         

